#### IFCExportElement Enumeration

---

|  |
| --- |
| See Also |

An enumerated type defining if an element is exported to IFC or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum IFCExportElement ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration IFCExportElement ``` |

| Visual C++ |
| --- |
| ``` public enum class IFCExportElement ``` |

# Members

| Member name | Description |
| --- | --- |
| ByType | Export element to IFC according to type settings. |
| Yes | Export element to IFC regardless of type or category settings. |
| No | Don't export element to IFC regardless of type or category settings. |

# See Also

Autodesk.Revit.DB Namespace